Repository: Mak5er/Joke-Bot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: uk

source: ↩️Cancel
uk: ↩️Скасувати

source: Enter in Conversation
uk: Перейти до розмови

source: Write as a bot
uk: Написати як бот

source: ❌Ban
uk: ❌Забанити

source: ✅Unban
uk: ✅Розбанити

source: 🔙Back
uk: 🔙Назад

source: User not found!
uk: Користувача не знайдено!

source: Enter ban reason:
uk: Введіть причину бану:

source: Please type your answer:
uk: Будь ласка, напишіть свою відповідь:

source: Your message <b>{message_id}</b> was seen! <b>Answer:</b> <code>{answer}</code>
uk: Ваше повідомлення <b>{message_id}</b> було переглянуто! <b>Відповідь:</b> <code>{answer}</code>

source: Your answer sent!
uk: Вашу відповідь надіслано!

source: Something went wrong, see log for more information!
uk: Щось пішло не так, дивіться лог для отримання додаткової інформації!

source: Please type message:
uk: Будь ласка, введіть своє повідомлення:

source: <b>Ideas for you:</b>
uk: <b>Ідеї для вас:</b>

source: There are no ideas for you.
uk: Немає жодних ідей для вас.

source: ❌Delete
uk: ❌Видалити

source: Page
uk: Сторінка

source: 📝Add a joke
uk: 📝Додати анекдот

source: 💬Mailing
uk: 💬Розсилка

source: 🎭Joke of the day
uk: 🎭Анекдот дня

source: 📄View log
uk: 📄Переглянути лог

source: ❌📄Delete log
uk: ❌📄Видалити лог

source: 👤Control User
uk: 👤Керувати користувачами

source: 🔀Random joke
uk: 🔀Випадковий анекдот

source: 🔖Select category
uk: 🔖Обрати категорію

source: 💵Money
uk: 💵Гроші

source: 👨‍👩‍👦‍👦Family
uk: 👨‍👩‍👦‍👦Родина

source: 👱‍♀️Blondes
uk: 👱‍♀️Блондинки

source: 👵Mother-in-law
uk: 👵Теща

source: 🏫School
uk: 🏫Школа

source: 👦Vovochka
uk: 👦Вовочка

source: 🏥Medicine
uk: 🏥Медицина

source: 🎓Students
uk: 🎓Студенти

source: 🏢Work
uk: 🏢Робота

source: 🔃Update rating
uk: 🔃Оновити рейтинг

source: 👀Viewed
uk: 👀Переглянув

source: Feedback💬
uk: Зворотний зв'язок💬

source: Answer💬
uk: Відповісти💬

source: Hello <b>{name}</b>! I'm a bot with jokes. Full information on the bot /info List of commands /help
uk: Привіт, <b>{name}</b>! Я бот з анекдотами. Повна інформація про бота /info Список команд /help

source: Hello, this is the admin panel. 🪪Number of bot users: <b>{user_count}</b> 📱Number of active users: <b>{active_user_count}</b> 📵Number of inactive users: <b>{inactive_user_count}</b> 🃏Number of jokes in the database: <b>{joke_count}</b> 📬Total number of jokes read: <b>{sent_count}</b> Admin commands: /ideas - list ideas from users /get_users - download table with all users info /system_info - get info about system
uk: Привіт, це панель адміністратора. 🪪Кількість користувачів бота: <b>{user_count}</b> 📱Кількість активних користувачів: <b>{active_user_count}</b> 📵Кількість неактивних користувачів: <b>{inactive_user_count}</b> 🃏Кількість анекдотів у базі: <b>{joke_count}</b> 📬Кількість прочитаних жартів: <b>{sent_count}</b> Команди адміна: /ideas - список ідей від користувачів /get_users - скачати таблицю зі всіма користувачами /system_info - отримати інфориацію про систему

source: Hello <b>{username}</b>! You are an administrator, to see more information and controls, please type /admin. Statistics: 📁Number of jokes in the database: <b>{joke_count}</b> 📚Jokes read by you: <b>{joke_sent}</b> 📬Total number of jokes read by everyone: <b>{sent_count}</b> Total referrals: <b>{refs_count}</b> Your ref link: <a href="{ref_url}">{ref_url}</a> Bot site - <a href="https://anekdoty.pp.ua">https://anekdoty.pp.ua</a> <b>If you want to offer an anecdote or ask a question, click the Feedback💬 button!</b>
uk: Привіт, <b>{username}</b>! Ви адміністратор, щоб побачити більше інформації та елементів керування, будь ласка, введіть /admin. Статистика: 📁Кількість анекдотів у базі даних: <b>{joke_count}</b> 📚Анекдотів прочитано вами: <b>{joke_sent}</b> 📬Анекдотів прочитано усіма: <b>{sent_count}</b> Всього рефералів: <b>{refs_count}</b> Ваше реф-посилання: {ref_url} Сайт бота - https://anekdoty.pp.ua <b>Хочете запропонувати анекдот або задати запитання? Натисніть нопку Зворотний зв'язок💬!</b>

source: Hello <b>{username}</b>! I am a bot where you can read jokes. Statistics: 📁Number of jokes in the database: <b>{joke_count}</b> 📚Jokes read by you: <b>{joke_sent}</b> 📬Total number of jokes read by everyone: <b>{sent_count}</b> Total referrals: <b>{refs_count}</b> Your ref link: <a href="{ref_url}">{ref_url}</a> Bot site - <a href="https://anekdoty.pp.ua">https://anekdoty.pp.ua</a> <b>If you want to offer an anecdote or ask a question, click the Feedback💬 button!</b>
uk: Привіт, <b>{username}</b>! Я бот, в якому ви можете читати анекдоти. Статистика: 📁Кількість анекдотів у базі даних: <b>{joke_count}</b> 📚Анекдотів прочитано вами: <b>{joke_sent}</b> 📬Анекдотів прочитано усіма: <b>{sent_count}</b> Всього рефералів: <b>{refs_count}</b> Ваше реф-посилання: {ref_url} Сайт бота - https://anekdoty.pp.ua <b>Хочете запропонувати анекдот або задати запитання? Натисніть нопку Зворотний зв'язок💬!</b>

source: 🤖 This is a bot with jokes. Here is a list of available commands: ️/start - start interacting with the bot /joke - get a random joke /info - get information about the bot /find - find joke by id or text /language - change language
uk: 🤖 Це бот з анекдотами. Ось список доступних команд: ️/start - почати взаємодію з ботом /joke - отримати випадковий анекдот /info - отримати інформацію про бота /find - знайти текст за Id або текстом /language - змінити мову

source: 📊Rating: <b>{joke_rate}</b>
uk: 📊Оцінка: <b>{joke_rate}</b>

source: You 👍 this!
uk: Ви 👍 це!

source: You 👎 this!
uk: Ви 👎 це!

source: You revoked your vote!
uk: Ви відкликали свій голос!

source: 🔃The rating is updated!
uk: 🔃Рейтинг оновлено!

source: You have marked this joke as read!
uk: Ви позначили цей анекдот як прочитаний!

source: You have already marked this joke as read!
uk: Ви вже позначали цей анекдот як прочитаний!

source: Mailing is complete!
uk: Розсилка завершена!

source: Starting mailing...
uk: Починаю розсилку...

source: Click the button to get the joke.
uk: Натисніть кнопку, щоб отримати анекдот.

source: Unfortunately, all the jokes have already been sent to you.
uk: На жаль, всі анекдоти вже надіслані вам.

source: <b>Joke of the day:</b> {joke_text}
uk: <b>Анекдот дня:</b> {joke_text}

source: <b>{name}</b>, I don't understand you! Type /help to get a list of commands! <b>If you want to offer an anecdote or ask a question, click the Feedback💬 button!</b>
uk: <b>{name}</b>, я вас не розумію! Введіть /help, щоб отримати список команд! <b>Хочете запропонувати анекдот або задати запитання? Натисніть нопку Зворотний зв'язок💬!</b>

source: This command cannot be used in a group!
uk: Цю команду не можна використовувати в групі!

source: Log deleted, starting to write a new one.
uk: Лог видалено, починаю писати новий.

source: Enter the message to send:
uk: Введіть повідомлення для відправки:

source: Action canceled
uk: Дію скасовано

source: Enter a new joke:
uk: Введіть новий анекдот:

source: The anecdote is given to the database.
uk: Анекдот додано до бази даних.

source: Hi! Thank you for adding me to <b>'{chat_title}'</b> For correct operation, please grant me administrator rights! Type /help to get a list of commands
uk: Привіт! Дякую, що додали мене в <b>'{chat_title}'</b>. Для коректної роботи, будь ласка, надайте мені права адміністратора! Введіть /help, щоб отримати список команд

source: Please choose your language!
uk: Будь ласка, оберіть свою мову!

source: <b>USER INFO</b> <b>Name</b>: {user_name} <b>ID</b>: {user_id} <b>Username</b>: {user_username} <b>Status</b>: {status}
uk: <b>ІНФОРМАЦІЯ ПРО КОРИСТУВАЧА</b> <i>Ім'я</i>: <b>{user_name}</b> <i>ID</i>: <b>{user_id}</b> <i>Юзернейм</i>: <b>{user_username}</b> <i>Статус</i>: <b>{status}</b>

source: 🚫You have been banned, contact @mak5er for more information! Reason: {reason}
uk: 🚫Вас було заблоковано, зверніться до @mak5er за додатковою інформацією! Причина: {reason}

source: 🎉You have been unbanned!
uk: 🎉Вас розблоковано!

source: User {banned_user_id} successfully banned!
uk: Користувач {banned_user_id} успішно забанений!

source: User {unbanned_user_id} successfully unbanned!
uk: Користувач {unbanned_user_id} успішно розбанений!

source: <b>New message</b> from user: <b>{user}</b> <b>Message:</b> <code>{feedback_message}</code>
uk: <b>Нове повідомлення</b> від користувача: <b>{user}</b> <b>Повідомлення:</b> <code>{feedback_message}</code>

source: Pick a joke:
uk: Обери анекдот:

source: <b>System information:</b> {pc_info}
uk: <b>Інформація про систему:</b> {pc_info}

source: <b>Operating System</b>: <i>{operating_system}</i> <b>OS Version</b>: <i>{os_version}</i> <b>Machine Name</b>: <i>{machine_name}</i> <b>Processor Architecture</b>: <i>{processor_architecture}</i> <b>Processor Model</b>: <i>{processor_model}</i> <b>Physical Cores</b>: <i>{physical_cores}</i> <b>Logical Cores</b>: <i>{logical_cores}</i> <b>Total Memory</b>: <i>{total_memory:.2f}</i> MB <b>Available Memory</b>: <i>{available_memory:.2f}</i> MB <b>Memory Usage</b>: <i>{memory_usage}</i>%
uk: <b>Операційна система</b>: <i>{operating_system}</i> <b>Версія операційної системи</b>: <i>{os_version}</i> <b>Ім'я машини</b>: <i>{machine_name}</i> <b>Архітектура процесора</b>: <i>{processor_architecture}</i> <b>Модель процесора</b>: <i>{processor_model}</i> <b>Кількість фізичних ядер</b>: <i>{physical_cores}</i> <b>Кількість логічних ядер</b>: <i>{logical_cores}</i> <b>Загальний об'єм пам'яті</b>: <i>{total_memory:.2f}</i> МБ <b>Доступна пам'ять</b>: <i>{available_memory:.2f}</i> МБ <b>Використання пам'яті</b>: <i>{memory_usage}</i>%

source: Search user by:
uk: Шукати користувача по:

source: Type user {search}:
uk: Введіть {search} користувача:

source: Action canceled!
uk: Дію скасовано

source: Your message sent!
uk: Ваше повідомлення надіслано!

source: Idea deleted.
uk: Ідею видалено.

source: Referral <b>{user_id}</b> has registered at your invitation! Total number of invitees: <b>{refs_count}</b>
uk: Реферал <b>{user_id}</b> зареєструвався за вашим запрошенням! Загальна кількість запрошених: <b>{refs_count}</b>

source: Please enter your message:
uk: Будь ласка, введіть своє повідомлення:

source: Your message <b>{feedback_message_id}</b> sent!
uk: Ваше повідомлення <b>{feedback_message_id}</b> надіслано!

source: Please select category:
uk: Будьласка оберіть категорію:

source: Nothing was found.
uk: Нічого не знайдено.

source: Type joke text or ID:
uk: Введіть текст або ID анекдоту:

source: You are banned please contact to @mak5er for more information!
uk: Ви заблоковані, зверніться до @mak5er за додатковою інформацією!
